## Data Validation for DVD Rental Dataset

This notebook loads all of the data sets used in this SQL tool and quickly QAs them to make sure the level of data dirtiness is as expected. Any unexpected irregularities should be noted and fixed accordingly.

In [1]:
%%capture
import pandas as pd
import sqlalchemy
import psycopg2
import sqlite3

%reload_ext sql
%config SqlMagic.displaylimit = 10
%sql sqlite://
    
%store -r actor
%store -r film_actor
%store -r customer
%store -r film_category
%store -r films
%store -r language
%store -r rental

%sql persist actor
%sql persist film_actor
%sql persist customer
%sql persist film_category
%sql persist films
%sql persist language
%sql persist rental

### Actor Dataset
* Looks at overall data schema and performs basic distinct counts
* Update dates can be all the same time or different (assume that actors are manually maintained by an intern heh)
* Expect dirty data (duplicate actors in the system)

In [2]:
%%sql
select * from actor

 * sqlite://
Done.

[(0, 1, 'Penelope', 'Guiness', '2/15/06 10:05'),
 (1, 2, 'Nick', 'Wahlberg', '2/15/06 10:05'),
 (2, 3, 'Ed', 'Chase', '2/15/06 10:05'),
 (3, 4, 'Jennifer', 'Davis', '2/15/06 10:05'),
 (4, 5, 'Johnny', 'Lollobrigida', '2/15/06 10:05'),
 (5, 6, 'Bette', 'Nicholson', '2/15/06 10:05'),
 (6, 7, 'Grace', 'Mostel', '2/15/06 10:05'),
 (7, 8, 'Matthew', 'Johansson', '2/15/06 10:05'),
 (8, 9, 'Joe', 'Swank', '2/15/06 10:05'),
 (9, 10, 'Christian', 'Gable', '2/15/06 10:05'),
 (10, 11, 'Zero', 'Cage', '2/15/06 10:05'),
 (11, 12, 'Karl', 'Berry', '2/15/06 10:05'),
 (12, 13, 'Uma', 'Wood', '2/15/06 10:05'),
 (13, 14, 'Vivien', 'Bergen', '2/15/06 10:05'),
 (14, 15, 'Cuba', 'Olivier', '2/15/06 10:05'),
 (15, 16, 'Fred', 'Costner', '2/15/06 10:05'),
 (16, 17, 'Helen', 'Voight', '2/15/06 10:05'),
 (17, 18, 'Dan', 'Torn', '2/15/06 10:05'),
 (18, 19, 'Bob', 'Fawcett', '2/15/06 10:05'),
 (19, 20, 'Lucille', 'Tracy', '2/15/06 10:05'),
 (20, 21, 'Kirsten', 'Paltrow', '2/15/06 10:05'),
 (21, 22, 'Elvis', 'Marx', '2/15/06 10:05'),
 (22, 23, 'Sandra', 'Kilmer', '2/15/06 10:05'),
 (23, 24, 'Cameron', 'Streep', '2/15/06 10:05'),
 (24, 25, 'Kevin', 'Bloom', '2/15/06 10:05'),
 (25, 26, 'Rip', 'Crawford', '2/15/06 10:05'),
 (26, 27, 'Julia', 'Mcqueen', '2/15/06 10:05'),
 (27, 28, 'Woody', 'Hoffman', '2/15/06 10:05'),
 (28, 29, 'Alec', 'Wayne', '2/15/06 10:05'),
 (29, 30, 'Sandra', 'Peck', '2/15/06 10:05'),
 (30, 31, 'Sissy', 'Sobieski', '2/15/06 10:05'),
 (31, 32, 'Tim', 'Hackman', '2/15/06 10:05'),
 (32, 33, 'Milla', 'Peck', '2/15/06 10:05'),
 (33, 34, 'Audrey', 'Olivier', '2/15/06 10:05'),
 (34, 35, 'Judy', 'Dean', '2/15/06 10:05'),
 (35, 36, 'Burt', 'Dukakis', '2/15/06 10:05'),
 (36, 37, 'Val', 'Bolger', '2/15/06 10:05'),
 (37, 38, 'Tom', 'Mckellen', '2/15/06 10:05'),
 (38, 39, 'Goldie', 'Brody', '2/15/06 10:05'),
 (39, 40, 'Johnny', 'Cage', '2/15/06 10:05'),
 (40, 41, 'Jodie', 'Degeneres', '2/15/06 10:05'),
 (41, 42, 'Tom', 'Miranda', '2/15/06 10:05'),
 (42, 43, 'Kirk', 'Jovovich', '2/15/06 10:05'),
 (43, 44, 'Nick', 'Stallone', '2/15/06 10:05'),
 (44, 45, 'Reese', 'Kilmer', '2/15/06 10:05'),
 (45, 46, 'Parker', 'Goldberg', '2/15/06 10:05'),
 (46, 47, 'Julia', 'Barrymore', '2/15/06 10:05'),
 (47, 48, 'Frances', 'Day-Lewis', '2/15/06 10:05'),
 (48, 49, 'Anne', 'Cronyn', '2/15/06 10:05'),
 (49, 50, 'Natalie', 'Hopkins', '2/15/06 10:05'),
 (50, 51, 'Gary', 'Phoenix', '2/15/06 10:05'),
 (51, 52, 'Carmen', 'Hunt', '2/15/06 10:05'),
 (52, 53, 'Mena', 'Temple', '2/15/06 10:05'),
 (53, 54, 'Penelope', 'Pinkett', '2/15/06 10:05'),
 (54, 55, 'Fay', 'Kilmer', '2/15/06 10:05'),
 (55, 56, 'Dan', 'Harris', '2/15/06 10:05'),
 (56, 57, 'Jude', 'Cruise', '2/15/06 10:05'),
 (57, 58, 'Christian', 'Akroyd', '2/15/06 10:05'),
 (58, 59, 'Dustin', 'Tautou', '2/15/06 10:05'),
 (59, 60, 'Henry', 'Berry', '2/15/06 10:05'),
 (60, 61, 'Christian', 'Neeson', '2/15/06 10:05'),
 (61, 62, 'Jayne', 'Neeson', '2/15/06 10:05'),
 (62, 63, 'Cameron', 'Wray', '2/15/06 10:05'),
 (63, 64, 'Ray', 'Johansson', '2/15/06 10:05'),
 (64, 65, 'Angela', 'Hudson', '2/15/06 10:05'),
 (65, 66, 'Mary', 'Tandy', '2/15/06 10:05'),
 (66, 67, 'Jessica', 'Bailey', '2/15/06 10:05'),
 (67, 68, 'Rip', 'Winslet', '2/15/06 10:05'),
 (68, 69, 'Kenneth', 'Paltrow', '2/15/06 10:05'),
 (69, 70, 'Michelle', 'Mcconaughey', '2/15/06 10:05'),
 (70, 71, 'Adam', 'Grant', '2/15/06 10:05'),
 (71, 72, 'Sean', 'Williams', '2/15/06 10:05'),
 (72, 73, 'Gary', 'Penn', '2/15/06 10:05'),
 (73, 74, 'Milla', 'Keitel', '2/15/06 10:05'),
 (74, 75, 'Burt', 'Posey', '2/15/06 10:05'),
 (75, 76, 'Angelina', 'Astaire', '2/15/06 10:05'),
 (76, 77, 'Cary', 'Mcconaughey', '2/15/06 10:05'),
 (77, 78, 'Groucho', 'Sinatra', '2/15/06 10:05'),
 (78, 79, 'Mae', 'Hoffman', '2/15/06 10:05'),
 (79, 80, 'Ralph', 'Cruz', '2/15/06 10:05'),
 (80, 81, 'Scarlett', 'Damon', '2/15/06 10:05'),
 (81, 82, 'Woody', 'Jolie', '2/15/06 10:05'),
 (82, 83, 'Ben', 'Willis', '2/15/06 10:05'),
 (83, 84, 'James', 'Pitt', '2/15/06 10:05'),
 (84, 85, 'Minnie', 'Zellweger', '2/15/06 10:05'),
 (85, 143, 'River', 'Dean', '2/15/06 10:05'),
 (86, 86, 'Greg', 'Chaplin', '2/15/06 10:05'),
 (87, 87, 'Spencer', 'Peck', '2/15/06 10:05'),
 (88, 88, 'Kenneth', 'Pesci', '2/15/06 10:05'),
 (89, 89, 'Charlize', 'Dench', '2/15/06 10:05'),
 (90, 90, 'Sean', 'Guiness', '2/15/06 10:05'),
 (91, 91, 'Christopher', 'Berry', '2/15/06 10:05'),
 (92, 92, 'Kirsten', 'Akroyd', '2/15/06 10:05'),
 (93, 93, 'Ellen', 'Presley', '2/15/06 10:05'),
 (94, 94, 'Kenneth', 'Torn', '2/15/06 10:05'),
 (95, 95, 'Daryl', 'Wahlberg', '2/15/06 10:05'),
 (96, 96, 'Gene', 'Willis', '2/15/06 10:05'),
 (97, 97, 'Meg', 'Hawke', '2/15/06 10:05'),
 (98, 98, 'Chris', 'Bridges', '2/15/06 10:05'),
 (99, 99, 'Jim', 'Mostel', '2/15/06 10:05'),
 (100, 100, 'Spencer', 'Depp', '2/15/06 10:05'),
 (101, 101, 'Susan', 'Davis', '2/15/06 10:05'),
 (102, 102, 'Walter', 'Torn', '2/15/06 10:05'),
 (103, 103, 'Matthew', 'Leigh', '2/15/06 10:05'),
 (104, 104, 'Penelope', 'Cronyn', '2/15/06 10:05'),
 (105, 105, 'Sidney', 'Crowe', '2/15/06 10:05'),
 (106, 106, 'Groucho', 'Dunst', '2/15/06 10:05'),
 (107, 107, 'Gina', 'Degeneres', '2/15/06 10:05'),
 (108, 108, 'Warren', 'Nolte', '2/15/06 10:05'),
 (109, 109, 'Sylvester', 'Dern', '2/15/06 10:05'),
 (110, 110, 'Susan', 'Davis', '2/15/06 10:05'),
 (111, 111, 'Cameron', 'Zellweger', '2/15/06 10:05'),
 (112, 112, 'Russell', 'Bacall', '2/15/06 10:05'),
 (113, 113, 'Morgan', 'Hopkins', '2/15/06 10:05'),
 (114, 114, 'Morgan', 'Mcdormand', '2/15/06 10:05'),
 (115, 115, 'Harrison', 'Bale', '2/15/06 10:05'),
 (116, 116, 'Dan', 'Streep', '2/15/06 10:05'),
 (117, 117, 'Renee', 'Tracy', '2/15/06 10:05'),
 (118, 118, 'Cuba', 'Allen', '2/15/06 10:05'),
 (119, 119, 'Warren', 'Jackman', '2/15/06 10:05'),
 (120, 120, 'Penelope', 'Monroe', '2/15/06 10:05'),
 (121, 121, 'Liza', 'Bergman', '2/15/06 10:05'),
 (122, 122, 'Salma', 'Nolte', '2/15/06 10:05'),
 (123, 123, 'Julianne', 'Dench', '2/15/06 10:05'),
 (124, 124, 'Scarlett', 'Bening', '2/15/06 10:05'),
 (125, 125, 'Albert', 'Nolte', '2/15/06 10:05'),
 (126, 126, 'Frances', 'Tomei', '2/15/06 10:05'),
 (127, 127, 'Kevin', 'Garland', '2/15/06 10:05'),
 (128, 128, 'Cate', 'Mcqueen', '2/15/06 10:05'),
 (129, 129, 'Daryl', 'Crawford', '2/15/06 10:05'),
 (130, 130, 'Greta', 'Keitel', '2/15/06 10:05'),
 (131, 131, 'Jane', 'Jackman', '2/15/06 10:05'),
 (132, 132, 'Adam', 'Hopper', '2/15/06 10:05'),
 (133, 133, 'Richard', 'Penn', '2/15/06 10:05'),
 (134, 134, 'Gene', 'Hopkins', '2/15/06 10:05'),
 (135, 135, 'Rita', 'Reynolds', '2/15/06 10:05'),
 (136, 136, 'Ed', 'Mansfield', '2/15/06 10:05'),
 (137, 137, 'Morgan', 'Williams', '2/15/06 10:05'),
 (138, 138, 'Lucille', 'Dee', '2/15/06 10:05'),
 (139, 139, 'Ewan', 'Gooding', '2/15/06 10:05'),
 (140, 140, 'Whoopi', 'Hurt', '2/15/06 10:05'),
 (141, 141, 'Cate', 'Harris', '2/15/06 10:05'),
 (142, 142, 'Jada', 'Ryder', '2/15/06 10:05'),
 (143, 144, 'Angela', 'Witherspoon', '2/15/06 10:05'),
 (144, 145, 'Kim', 'Allen', '2/15/06 10:05'),
 (145, 146, 'Albert', 'Johansson', '2/15/06 10:05'),
 (146, 147, 'Fay', 'Winslet', '2/15/06 10:05'),
 (147, 148, 'Emily', 'Dee', '2/15/06 10:05'),
 (148, 149, 'Russell', 'Temple', '2/15/06 10:05'),
 (149, 150, 'Jayne', 'Nolte', '2/15/06 10:05'),
 (150, 151, 'Geoffrey', 'Heston', '2/15/06 10:05'),
 (151, 152, 'Ben', 'Harris', '2/15/06 10:05'),
 (152, 153, 'Minnie', 'Kilmer', '2/15/06 10:05'),
 (153, 154, 'Meryl', 'Gibson', '2/15/06 10:05'),
 (154, 155, 'Ian', 'Tandy', '2/15/06 10:05'),
 (155, 156, 'Fay', 'Wood', '2/15/06 10:05'),
 (156, 157, 'Greta', 'Malden', '2/15/06 10:05'),
 (157, 158, 'Vivien', 'Basinger', '2/15/06 10:05'),
 (158, 159, 'Laura', 'Brody', '2/15/06 10:05'),
 (159, 160, 'Chris', 'Depp', '2/15/06 10:05'),
 (160, 161, 'Harvey', 'Hope', '2/15/06 10:05'),
 (161, 162, 'Oprah', 'Kilmer', '2/15/06 10:05'),
 (162, 163, 'Christopher', 'West', '2/15/06 10:05'),
 (163, 164, 'Humphrey', 'Willis', '2/15/06 10:05'),
 (164, 165, 'Al', 'Garland', '2/15/06 10:05'),
 (165, 166, 'Nick', 'Degeneres', '2/15/06 10:05'),
 (166, 167, 'Laurence', 'Bullock', '2/15/06 10:05'),
 (167, 168, 'Will', 'Wilson', '2/15/06 10:05'),
 (168, 169, 'Kenneth', 'Hoffman', '2/15/06 10:05'),
 (169, 170, 'Mena', 'Hopper', '2/15/06 10:05'),
 (170, 171, 'Olympia', 'Pfeiffer', '2/15/06 10:05'),
 (171, 172, 'Groucho', 'Williams', '2/15/06 10:05'),
 (172, 173, 'Alan', 'Dreyfuss', '2/15/06 10:05'),
 (173, 174, 'Michael', 'Bening', '2/15/06 10:05'),
 (174, 175, 'William', 'Hackman', '2/15/06 10:05'),
 (175, 176, 'Jon', 'Chase', '2/15/06 10:05'),
 (176, 177, 'Gene', 'Mckellen', '2/15/06 10:05'),
 (177, 178, 'Lisa', 'Monroe', '2/15/06 10:05'),
 (178, 179, 'Ed', 'Guiness', '2/15/06 10:05'),
 (179, 180, 'Jeff', 'Silverstone', '2/15/06 10:05'),
 (180, 181, 'Matthew', 'Carrey', '2/15/06 10:05'),
 (181, 182, 'Debbie', 'Akroyd', '2/15/06 10:05'),
 (182, 183, 'Russell', 'Close', '2/15/06 10:05'),
 (183, 184, 'Humphrey', 'Garland', '2/15/06 10:05'),
 (184, 185, 'Michael', 'Bolger', '2/15/06 10:05'),
 (185, 186, 'Julia', 'Zellweger', '2/15/06 10:05'),
 (186, 187, 'Renee', 'Ball', '2/15/06 10:05'),
 (187, 188, 'Rock', 'Dukakis', '2/15/06 10:05'),
 (188, 189, 'Cuba', 'Birch', '2/15/06 10:05'),
 (189, 190, 'Audrey', 'Bailey', '2/15/06 10:05'),
 (190, 191, 'Gregory', 'Gooding', '2/15/06 10:05'),
 (191, 192, 'John', 'Suvari', '2/15/06 10:05'),
 (192, 193, 'Burt', 'Temple', '2/15/06 10:05'),
 (193, 194, 'Meryl', 'Allen', '2/15/06 10:05'),
 (194, 195, 'Jayne', 'Silverstone', '2/15/06 10:05'),
 (195, 196, 'Bela', 'Walken', '2/15/06 10:05'),
 (196, 197, 'Reese', 'West', '2/15/06 10:05'),
 (197, 198, 'Mary', 'Keitel', '2/15/06 10:05'),
 (198, 199, 'Julia', 'Fawcett', '2/15/06 10:05'),
 (199, 200, 'Thora', 'Temple', '2/15/06 10:05')]

In [3]:
%%sql
select count(*) from actor

 * sqlite://
Done.

[(200,)]

In [7]:
%%sql
-- Would be good if we had more than one duplicate
select sum(1) from (select distinct first_name, last_name from actor) unique_actors

 * sqlite://
Done.

[(199,)]

In [6]:
%%sql
select first_name, last_name from actor group by first_name, last_name having count(*) > 1

 * sqlite://
Done.

[('Susan', 'Davis')]

In [9]:
%%sql
-- Looks like the actor_ids are messed up!
select * from actor where first_name = 'Susan' and last_name = 'Davis'

 * sqlite://
Done.

[(101, 101, 'Susan', 'Davis', '2/15/06 10:05'),
 (110, 110, 'Susan', 'Davis', '2/15/06 10:05')]

In [ ]:
%%sql
-- Querying rentals
-- Case of converting a date to a string and then aggregating to the month level
SELECT left(cast(rental_date as varchar), 7) as month, count(*)
from rental 
GROUP BY left(cast(rental_date as varchar), 7)
ORDER BY MONTH desc

In [ ]:
%%sql
select * from
rental order by rental_id

In [ ]:
%%sql
SELECT COUNT(*) FROM rental

In [ ]:
%%sql
SELECT COUNT(DISTINCT rental_id) FROM rental

In [ ]:
%%sql
-- Investigating distinct values to determine what identifies a unique row 
SELECT 
    COUNT(DISTINCT rental_id) as rental_id_count,
    COUNT(DISTINCT rental_date) as rental_date_count,
    COUNT(DISTINCT inventory_id) as inventory_id_count, 
    COUNT(DISTINCT customer_id) as customer_id_count,
    COUNT(DISTINCT staff_id) as staff_id_count, 
    COUNT(DISTINCT last_update) as last_update_count
FROM rental

In [ ]:
%%sql
select 
    date_trunc('month', payment_date) as month,
    sum(amount) as amount
from payment
group by date_trunc('month', payment_date)
order by month

In [ ]:
%%sql

In [ ]:
%%sql
select distinct payment_date from payment order by payment_date

In [ ]:
%%sql
select date_trunc('day', rental_date), count(*) as count 
from rental
group by date_trunc('day', rental_date)
order by count desc

In [ ]:
%%sql
select 'rental' as table, min(rental_id) as min_id, max(rental_id) as max_id from rental

UNION

select 'payment' as table, min(rental_id) as min_id, max(rental_id) as max_id from payment

ORDER BY min_id

In [ ]:
%%sql
select * from payment where rental_id = 1400

In [ ]:
%%sql
select * from rental where rental_id = 1400

In [ ]:
%%sql
select count(*) from payment;

In [ ]:
%%sql
select count(distinct payment_id) from payment

In [ ]:
%%sql
select count(distinct rental_id) from payment

In [ ]:
%%sql
select p.rental_id, p.payment_id, p.customer_id, p.amount
from payment p
join 
(select rental_id, COUNT(*) as rental_count
 from payment group by rental_id 
 having COUNT(*) > 1) pr ON p.rental_id = pr.rental_id

In [ ]:
%%sql
select rental_id, customer_id from rental where rental_id = 4591

In [ ]:
%%sql
select rental_id, customer_id from rental where customer_id = 16

In [ ]:
%%sql
select count(distinct customer_id) from rental

In [ ]:
%%sql
select customer_id, count(*) as count from rental group by customer_id order by count desc

In [ ]:
%%sql
select count(distinct customer_id) from customer

In [ ]:
%%sql
select customer_id, count(*) as count from customer group by customer_id order by count desc

In [ ]:
%%sql
select distinct activebool from customer

In [ ]:
%%sql
select active, count(*) from customer group by active

In [ ]:
%%sql
select activebool, count(*) from customer group by activebool

In [ ]:
 %%sql
select email, count(customer_id) as count from customer group by email order by count desc

In [ ]:
%%sql
-- All of the create dates are the same! More likely the date that this was added to the 
select create_date, count(*) from customer group by create_date

In [ ]:
%%sql
select distinct create_date from customer

In [ ]:
%%sql
select avg(inv_count) 
from 
    (
    select film_id, count(distinct inventory_id) as inv_count 
    from inventory 
    group by film_id 
    order by inv_count desc
    ) a

In [ ]:
%%sql
select distinct first_name from customer order by first_name

In [ ]:
%%sql
select * from payment where payment_date IS NULL

In [ ]:
%%sql
select date_trunc('month', payment_date) as month, count(*)
from payment 
group by date_trunc('month', payment_date)

In [ ]:
%%sql
select customer_id from customer order by customer_id

In [ ]:
%%sql
select COUNT(CASE WHEN upper(description) LIKE '%MOOSE%' THEN 1 END) as moose_count, COUNT(*) from film

In [ ]:
%%sql
select count(distinct film_id) from film

In [ ]:
%%sql
select special_features from film

In [ ]:
%%sql
select distinct special_features from film

In [ ]:
%%sql
select * from film

In [ ]:
%%sql
select special_features, count(distinct film_id) as count 
from 
    (
    select film_id, unnest(special_features) as special_features from film
    ) a
group by special_features
order by count desc

In [ ]:
%%sql
select rating, count(distinct film_id) from film group by rating

In [ ]:
%%sql
select rental_rate, count(distinct film_id) from film group by rental_rate

In [ ]:
%%sql
select fulltext:'airport'] from film

In [ ]:
%%sql
ALTER TABLE film
DROP COLUMN fulltext

In [ ]:
%%sql
select * from film

In [ ]:
%%sql
select * from film

In [ ]:
%%sql
select f.film_id, title, MAX(inventory_id)-MIN(inventory_id)+1 as total_inventory
from film f
join inventory i on f.film_id = i.film_id
group by f.film_id, title
order by total_inventory desc

In [ ]:
%%sql
select f.film_id, title, inventory_id
from film f
left join inventory i on f.film_id = i.film_id
where inventory_id IS NULL

In [ ]:
%%sql
select count(distinct film_id) from inventory

In [ ]:
%%sql
select f.film_id, title, inventory_id
from film f
join inventory i on f.film_id = i.film_id

In [ ]:
%%sql
select count(distinct case when inventory_id is null then f.film_id end)
from film f
left join inventory i on f.film_id = i.film_id

In [ ]:
%%sql
select count(distinct f.film_id)
from film f
left join inventory i on f.film_id = i.film_id

In [ ]:
# NULLS ARE PRESENT IN THE INVENTORY TABLE
# THERE ARE FILMS IN THE FILM TABLE THAT ARE NOT IN THE INVENTORY TABLE

In [ ]:
%%sql
select * from film

In [ ]:
%%sql
select * from rental

In [ ]:
%%sql
select * from inventory

In [ ]:
%%sql
-- Number of rentals per customer
select customer_id, count(*) as count
from rental
group by customer_id 
order by count desc

In [ ]:
%%sql
select inventory_id, film_id from inventory i
join film f on i.film_id = f.film_id